org/blog.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog/

** New Toy: ox-hugo
   :PROPERTIES:
   :EXPORT_FILE_NAME: first-ox-hugo
   :EXPORT_DATE: 2018-12-04
   :END:

   I've recently fallen into a very deep Emacs-filled rabbit hole. It
   started with the goal of cleaning up my Emacs =init.el= file, but
   expanded to learning more Emacs Lisp and trying to get more out of
   Org-mode. Now I'm typing this post in Org-mode with a new toy:
   [[https://ox-hugo.scripter.co/][=ox-hugo=]]. This Emacs package makes it easy to create blog posts
   from a single Org-file by seamlessly exporting second level
   headlines to Hugo's Markdown syntax.

   Setting up =ox-hugo= was incredibly easy. With MELPA already
   configured, the only required addition to my init file was this:
   #+BEGIN_SRC emacs-lisp :results silent
     (use-package ox-hugo
       :ensure t
       :after ox)
   #+END_SRC
   Now, in the buffer I'm currently editing, I use the key-binding
   =C-c C-e H H= to export a ready-to-go markdown file for Hugo to
   parse.

   Luckily before I fell down the =ox-hugo= rabbit hole my Emacs
   configuration was already cleaned up to my liking, hopefully it
   stays that way for a while! It can be found [[https://github.com/drdavis/dotfiles/blob/master/emacs/emacs-init.org][right here]] (you'll see
   it's also written in Org-mode, with the Emacs Lisp blocks loaded
   via =org-babel-load-file=).

